[
    {
        "codigo": 507244,
        "titulo": "Caçadores do Fim do Mundo",
        "sinopse": "    Uma década após uma tempestade solar devastar o planeta e eliminar toda a tecnologia, um ex-soldado sobrevive caçando tesouros perdidos para os poucos poderosos que ainda restam. Sua nova missão é recuperar a Mona Lisa, de Leonardo da Vinci. Ele se une uma outra caçadora e se vê em uma perigosa corrida contra um senhor da guerra implacável que também está atrás da relíquia. Cercado por enigmas e ameaças, terá que escolher entre se apegar ao passado ou lutar por um novo futuro.​",
        "genero": "Ficção Científica, Ação, Comédia",
        "diretor": "J.J. Perry",
        "ano": "2025",
        "capa": "https://image.tmdb.org/t/p/w500/1ZhnVSuIPj0u1UBsrgkihYznbky.jpg",
        "trailer": "https://www.youtube.com/watch?v=1n2XxaTArVc"
    },
    {
        "codigo": 1156594,
        "titulo": "Nossa Culpa",
        "sinopse":  "O casamento de Jenna e Lion marca o tão esperado reencontro entre Noah e Nick após o término. A incapacidade de Nick de perdoar Noah é uma barreira intransponível. Ele, herdeiro dos negócios do avô, e ela, iniciando a vida profissional, evitam alimentar uma chama ainda acesa. Mas, agora que seus caminhos se cruzaram novamente, será o amor mais forte que o ressentimento?",
        "genero": "Romance, Drama",
        "diretor": "Domingo González",
        "ano": "2025",
        "capa": "https://image.tmdb.org/t/p/w500/tPq8xqhsTYZzUGwMKuksa0eyeGZ.jpg",
        "trailer": "https://www.youtube.com/watch?v=72e_AtbGazo"
    },
    {
        "codigo": 755898,
        "titulo": "A Guerra dos Mundos",
        "sinopse": "    Will Radford é um renomado analista de cibersegurança do Departamento de Segurança Interna dos Estados Unidos, encarregado de rastrear possíveis ameaças à segurança nacional por meio de um programa de vigilância em massa. No entanto, um ataque inesperado por uma entidade desconhecida o leva a suspeitar que o governo esteja escondendo algo dele… e do restante do mundo.",
        "genero": "Ficção Científica, Thriller",
        "diretor": "Rich Lee",
        "ano": "2025",
        "capa": "https://image.tmdb.org/t/p/w500/yvirUYrva23IudARHn3mMGVxWqM.jpg",
        "trailer": "https://www.youtube.com/watch?v=7e0ZUd8l96I"
    },
    {
        "codigo": 1305717,
        "titulo": "Hunting Grounds",
        "sinopse": "    Uma mãe que foge do marido ligado à máfia encontra abrigo com um andarilho chamado Jake, mas quando os capangas dele se aproximam, Jake se revela ainda mais perigoso do que quem ela tentava evitar.",
        "genero": "Ação, Thriller",
        "diretor": "Derek Barnes",
        "ano": "2025",
        "capa": "https://image.tmdb.org/t/p/w500/cgZjpqRQt9sk6XMCwZ3B1NPAaoy.jpg",
        "trailer": "https://www.youtube.com/watch?v=OWQnOLbykKA"
    },
    {
        "codigo": 1311031,
        "titulo": "Demon Slayer: Kimetsu no Yaiba Castelo Infinito",
        "sinopse": "    Enquanto os membros dos caçadores e os Hashira participavam de um rigoroso programa de fortalecimento coletivo, conhecido como Treinamento dos Hashira, em preparação para a batalha final contra os demônios, Muzan Kibutsuji aparece na Mansão Ubuyashiki. Com a vida do líder da organização em risco, Tanjiro e os Hashira correm até o quartel-general, mas acabam sendo lançados, pelas mãos de Muzan, em uma queda profunda rumo a um espaço misterioso para um confronto final, o Castelo Infinito.",
        "genero": "Animação, Ação, Fantasia, Thriller",
        "diretor": "Hikaru Kondô",
        "ano": "2025",
        "capa": "https://image.tmdb.org/t/p/w500/c55sXCaQBj3vuHqZe62tv90xCQS.jpg",
        "trailer": "https://www.youtube.com/watch?v=3UiP4GwWNv0"
    },
    {
        "codigo": 1511789,
        "titulo": "Captain Hook - The Cursed Tides",
        "sinopse": "    Após uma derrota devastadora sofrida por seu arquiinimigo, Almirante Smee, o notório Capitão James Hook encontra refúgio na cidade costeira de Eldritch Landing, onde forma uma aliança improvável com Silas Blackweather, um ferreiro local em busca de vingança pelo assassinato de sua irmã. Enquanto eles fogem dos soldados casacas vermelhas de Smee na densa floresta da ilha, lutas de espadas implacáveis, maldições antigas e motivos conflitantes desafiarão sua busca compartilhada por vingança. Juntos, Hook e Silas navegam em águas desconhecidas para enfrentar o traiçoeiro Almirante Smee, embarcando em uma jornada que redefinirá o legado duradouro do Capitão Gancho.",
        "genero": "Aventura, Ação, Terror",
        "diretor": "Lars Janssen",
        "ano": "2025",
        "capa": "https://image.tmdb.org/t/p/w500/bcP7FtskwsNp1ikpMQJzDPjofP5.jpg",
        "trailer": "https://www.youtube.com/watch?v=CJq1Vci8gtc"
    },
    {
        "codigo": 1290159,
        "titulo": "Casa de Dinamite",
        "sinopse": "    Depois que um míssil sem autoria identificada é lançado contra os Estados Unidos, começa uma corrida contra o tempo para encontrar o responsável e preparar uma resposta.",
        "genero": "Thriller, Guerra",
        "diretor": "Kathryn Bigelow",
        "ano": "2025",
        "capa": "https://image.tmdb.org/t/p/w500/rXo2FotSlBMg1MynsV276QIskN9.jpg",
        "trailer": "https://www.youtube.com/watch?v=LNGDvEvc54A"
    },
    {
        "codigo": 1280450,
        "titulo": "Garota Roubada",
        "sinopse": "    Uma mulher americana passa mais de dez anos procurando sua filha, sequestrada e levada para o Oriente Médio pelo pai, enfrentando perigos e desafios em sua busca incansável.",
        "genero": "Thriller, Ação, Aventura",
        "diretor": "James Kent",
        "ano": "2025",
        "capa": "https://image.tmdb.org/t/p/w500/hpwmR1AE8Ro0KO68YPhk1thACvL.jpg",
        "trailer": "https://www.youtube.com/watch?v=ebbFZmqsGbs"
    },
    {
        "codigo": 1306525,
        "titulo": "O Elixir",
        "sinopse": "    Um elixir desperta os mortos-vivos em uma vila. Em meio ao terror, uma família em conflito precisa se unir e lutar para sobreviver enquanto a cidade entra em colapso.",
        "genero": "Terror, Thriller",
        "diretor": "Kimo Stamboel",
        "ano": "2025",
        "capa": "https://image.tmdb.org/t/p/w500/45OuEJ4leKmQl9oQCEcQQTBDFwl.jpg",
        "trailer": "https://www.youtube.com/watch?v=05mMxv9Q2cM"
    },
    {
        "codigo": 861451,
        "titulo": "O Guerreiro",
        "sinopse": "    A jornada de um homem que descobre a si mesmo, encontra o amor e luta por sua terra natal - será que ele conseguirá manter o controle em todas as três frentes?",
        "genero": "Ação, Drama, Thriller",
        "diretor": "A P Arjun",
        "ano": "2024",
        "capa": "https://image.tmdb.org/t/p/w500/vTWAbfrkhK0I0Dbz7MlgiN58QaC.jpg",
        "trailer": "https://www.youtube.com/watch?v=fqLCas2sWW0"
    },
    {
        "codigo": 1519168,
        "titulo": "The Jester 2",
        "sinopse": "    Quando a mágica adolescente Max se cruza com o sinistro Jester na noite de Halloween, ela deve ser mais esperta que um assassino sobrenatural cuja magia é muito real e cujos truques sempre acabam em sangue.",
        "genero": "Terror, Thriller, Crime",
        "diretor": "Colin Krawchuk",
        "ano": "2025",
        "capa": "https://image.tmdb.org/t/p/w500/giV7FS7HGyxRbwqxudXPvv1RgXD.jpg",
        "trailer": "https://www.youtube.com/watch?v=cHzJyoZZVrs"
    },
    {
        "codigo": 1218925,
        "titulo": "Chainsaw Man – O Filme: Arco da Reze",
        "sinopse": "    Denji se tornou o \"Homem-Motosserra\", um garoto com um coração de demônio, e agora faz parte dos Caçadores de Demônios da Divisão Especial 4. Após um encontro com Makima, a mulher dos seus sonhos, Denji se abriga da chuva. Lá ele conhece Reze, uma garota que trabalha em um café.",
        "genero": "Animação, Ação, Romance, Fantasia",
        "diretor": "Tatsuya Yoshihara",
        "ano": "2025",
        "capa": "https://image.tmdb.org/t/p/w500/tj1XhCQ2Rw2sT2o7lIdqPIYvjsx.jpg",
        "trailer": "https://www.youtube.com/watch?v=N2jnVpXKOq0"
    },
    {
        "codigo": 1284120,
        "titulo": "A Meia-Irmã Feia",
        "sinopse": "    Em um reino de conto de fadas onde a beleza é um negócio brutal, Elvira luta para competir com sua meia-irmã incrivelmente linda, e ela fará de tudo para chamar a atenção do príncipe. Uma versão moderna e bem diferente do Conto da \"Cinderela\".",
        "genero": "Terror, Comédia, Fantasia, Drama",
        "diretor": "Emilie Blichfeldt",
        "ano": "2025",
        "capa": "https://image.tmdb.org/t/p/w500/lgO9ZdNe2ikRmQbLYnSHPxgunyP.jpg",
        "trailer": "https://www.youtube.com/watch?v=LCLMFJj5Rao"
    },
    {
        "codigo": 1038392,
        "titulo": "Invocação do Mal - O Último Ritual",
        "sinopse": "    Neste último capítulo, os Warren enfrentam mais um caso aterrorizante, desta vez envolvendo entidades misteriosas que desafiam sua experiência. Ed (Patrick Wilson) e Lorraine (Vera Farmiga) se veem obrigados a encarar seus maiores medos, colocando suas vidas em risco em uma batalha final contra forças malignas.",
        "genero": "Terror",
        "diretor": "Michael Chaves",
        "ano": "2025",
        "capa": "https://image.tmdb.org/t/p/w500/40nHGUfypLhlr7gJx8At1IbYkaK.jpg",
        "trailer": "https://www.youtube.com/watch?v=_MRJZrXZeQk"
    },
    {
        "codigo": 604079,
        "titulo": "A Longa Marcha: Caminhe ou Morra",
        "sinopse": "    Um grupo de adolescentes compete em uma competição anual conhecida como \"A Longa Marcha\", onde eles devem manter uma certa velocidade de caminhada ou levar um tiro.",
        "genero": "Thriller, Terror, Ficção Científica",
        "diretor": "Francis Lawrence",
        "ano": "2025",
        "capa": "https://image.tmdb.org/t/p/w500/qE0XKOHZvXtiM4aBLlTPUVZiIc5.jpg",
        "trailer": "https://www.youtube.com/watch?v=VhbG-hEHRXE"
    },
    {
        "codigo": 1072699,
        "titulo": "Furioza 2",
        "sinopse": "    Após um assassinato, o novo líder da Furioza, Golden, toma as rédeas de sua gangue violenta e assume um novo foco entre as fronteiras.",
        "genero": "Ação, Crime, Thriller",
        "diretor": "Cyprian T. Olencki",
        "ano": "2025",
        "capa": "https://image.tmdb.org/t/p/w500/huvM6PcelNHpL3ldtgDpxstQWqN.jpg",
        "trailer": "https://www.youtube.com/watch?v=GC9wje4-d78"
    },
    {
        "codigo": 7451,
        "titulo": "Triplo X",
        "sinopse": "    O ex-atleta de esportes extremos Xander \"XXX\" Cage, famoso por suas acrobacias que desafiam a morte, é convencido de que pode ter sucesso em ações que espiões convencionais falharam. Xander é recrutado pelo agente Gibbons para se tornar um tipo diferente de agente secreto. Agora, em uma perigosa missão, ele precisa usar todas as suas habilidades para combater um inimigo mortal.",
        "genero": "Ação, Aventura, Thriller, Crime",
        "diretor": "Rob Cohen",
        "ano": "2002",
        "capa": "https://image.tmdb.org/t/p/w500/lpmyeqSR2Pc7ytfTp1ScD3ferX4.jpg",
        "trailer": "https://www.youtube.com/watch?v=7LDoxchQksM"
    },
    {
        "codigo": 1197137,
        "titulo": "O Telefone Preto 2",
        "sinopse": "    Quatro anos após escapar de The Grabber, Finney Blake luta com sua vida após o cativeiro. Quando sua irmã Gwen começa a receber ligações em sonhos do telefone preto e a ter visões perturbadoras de três garotos sendo perseguidos em um acampamento de inverno conhecido como Alpine Lake, os irmãos se determinam a desvendar o mistério e confrontar um assassino que se tornou mais poderoso na morte e mais significativo para eles do que qualquer um poderia imaginar.",
        "genero": "Terror, Thriller",
        "diretor": "Scott Derrickson",
        "ano": "2025",
        "capa": "https://image.tmdb.org/t/p/w500/p3epSUdF9qSWWHTBlA3mJ0w2i2Y.jpg",
        "trailer": "https://www.youtube.com/watch?v=4FTqSFaKyjs"
    },
    {
        "codigo": 803796,
        "titulo": "Guerreiras do K-Pop",
        "sinopse": "    Quando não estão lotando estádios, as estrelas do K-pop Rumi, Mira e Zoey usam seus poderes secretos para proteger os fãs contra ameaças sobrenaturais.",
        "genero": "Fantasia, Música, Comédia, Animação",
        "diretor": "Maggie Kang",
        "ano": "2025",
        "capa": "https://image.tmdb.org/t/p/w500/gbdMa7woiuF7IiEB5Spwv5od4oo.jpg",
        "trailer": "https://www.youtube.com/watch?v=pIb3zixhP3A"
    },
    {
        "codigo": 338969,
        "titulo": "O Vingador Tóxico",
        "sinopse": "Um terrível acidente tóxico transforma o zelador Winston Gooze, doente terminal, em uma nova evolução de herói: o Vingador Tóxico. Agora, empunhando um esfregão brilhante com força sobre-humana, ele precisa correr contra o tempo para salvar seu filho e deter um tirano implacável e sedento de poder, determinado a usar superpoderes tóxicos para fortalecer seu império poluído.",
        "genero": "Ação, Comédia, Ficção Científica",
        "diretor": "Macon Blair",
        "ano": "2025",
        "capa": "https://image.tmdb.org/t/p/w500/hgLUFJdveYcL9OvnFAnvtCczcqj.jpg",
        "trailer": "https://www.youtube.com/watch?v=j2aec9tWWCY"
    }
]